"""
Основні операції зі словниками

=================================================================================================]
Створення словника	          |d = {"name": "Anna", "age": 25}	
Доступ до значення по ключу	  |d["name"]	               Поверне "Anna"
Додавання або зміна значення  |d["city"] = "Kyiv"	       Додає новий ключ "city"
Видалення елемента	del       |d["age"]	                   Видаляє пару з ключем "age"
Перевірка наявності ключа	  |"name" in d	               Поверне True або False
Перебір ключів	              |for key in d:	           Ітерує по ключах
Перебір пар ключ-значення	  |for k, v in d.items():	   Ітерує по парам
Отримання значення з дефолтом |d.get("phone", "No phone")  Якщо ключа немає — поверне "No phone"
=================================================================================================]
"""

"""
Задача 1: (Програмістська)

Створи словник student із ключами: "name", "age", "courses" (список предметів). Виведи інформацію у форматі:

Студент: Ім'я, Вік років
Навчається на курсах: курс1, курс2, курс3
"""
### 
print('\nTASK 1\n')

student = {
    "name": "Andriy",
    "age": 22,
    "courses": ["Math", "Physics", "Programming"]
}

print(f"Student: {student['name']}, Age: {student['age']}")
print(f"Learn: {', '.join(student['courses'])}")

"""
Задача 2: (Географічна)

Дано словник із країнами та їх столицями:

capitals = {
    "Ukraine": "Kyiv",
    "Germany": "Berlin",
    "France": "Paris",
    "Italy": "Rome"
}

Користувач вводить назву країни — виведи її столицю або повідомлення, що країни немає у словнику.

"""
###
print('\nTASK 2\n')

capitals = {
    "Ukraine": "Kyiv",
    "Germany": "Berlin",
    "France": "Paris",
    "Italy": "Rome"
}

country = input('Type the country: ')

print(f"The Capital of {country} is {capitals.get(country, 'not in Dictionary')}")


"""
Задача 3: (Історична)

Створи словник подій історії із роками:

events = {
    1989: "Падіння Берлінської стіни",
    1969: "Місяцева місія Apollo 11",
    1945: "Закінчення Другої світової війни"
}

Виведи всі роки та події у хронологічному порядку.
"""
print('\nTASK 3\n')

events = {
    1989: "Падіння Берлінської стіни",
    1969: "Місяцева місія Apollo 11",
    1945: "Закінчення Другої світової війни"
}

for event_key in sorted(events):
    print(f"Year {event_key} - {events[event_key]}")

"""
Задача 4: (Математична)

Створи словник, де ключ — число від 1 до 10, а значення — квадрат числа. Виведи словник.
"""
print('\nTASK 4\n')

num_dict = {i: i**2 for i in range(1, 11)}

for k, v in num_dict.items():
    print(f"N^2: {k} = {v}")