"""
Задача 1: Автомобільний пробіг

Опис:
Водій щодня їздить 100 км. Порахуй, скільки днів потрібно, щоб проїхати відстань, введену користувачем (наприклад, 750 км), використовуючи while.
"""



"""
Задача 2: Пошук авто в списку

garage = ["Opel", "Mazda", "Tesla", "BMW", "Audi"]

Користувач вводить назву машини. Програма шукає її у списку:

    Якщо є — виводить "Авто знайдене на X позиції"

    Якщо ні — "Немає в гаражі"

Використати: цикл for, break, else.
"""



"""
Задача 3: Заряд акумулятора

Акумулятор заряджається по 10% щохвилини.
Початковий рівень — 30%.
Симулюй зарядку до 100%, виводячи статус кожної хвилини.

Додатково: якщо досягнуто 80%, вивести попередження: "Можна вже їхати"
"""




"""
Задача 4 (комплексна): Обслуговування автопарку

У тебе є список авто з пробігом:

fleet = [
    {"model": "BMW", "km": 120000},
    {"model": "Tesla", "km": 80000},
    {"model": "Audi", "km": 145000},
    {"model": "Opel", "km": 98000}
]

Завдання:

    Для кожного авто визначити, чи потрібно ТО (якщо пробіг > 100_000)

    Порахувати загальний пробіг усього автопарку

    Вивести список авто, які ще "на ходу"
"""





"""
Домашнє завдання:

    Створи симулятор заправки:

        Ємність баку — 60 л

        Заправка йде по 5 л за крок

        Виводити статус після кожного кроку

        Коли бак повний — зупинити цикл і вивести: "Заправку завершено"
"""