"""
=============================================================================================]
Основні функції та методи множин:

set()	                   Створення множини	s = set([1, 2, 3, 2])
add(elem)	               Додає елемент	    s.add(5)
remove(elem)               Видаляє елемент (помилка, якщо його немає)	       s.remove(3)
discard(elem)              Видаляє, не викликає помилку, якщо елемента немає   s.discard(3)
clear()	                   Очищає множину	    s.clear()
union(set2)                Об'єднання множин
intersection(set2)         Перетин	            a & b або a.intersection(b)
difference(set2)           Різниця	            a - b
symmetric_difference() 	   Симетрична різниця	a ^ b
len(set)	               Кількість елементів	len(s)
=============================================================================================]
"""

"""
🔧 Задача 1: Унікальні літери в тексті

Завдання:
Користувач вводить рядок (будь-якою мовою). Вивести всі унікальні літери, що в ньому є (без пробілів, цифр, знаків).

Порада: перевести в нижній регістр, використати множину.
"""
###
print('\nTASK 1\n')

text = input('Type the text: ').lower()
set_letters = set(text) 
print(set_letters)

"""
"""